[
  {
    "Name":"Customer Behaviour Analysis",
    "Description":"Conducted unsupervised machine learning and statistical analysis to cluster Esselunga customers based on their online behavior and purchase patterns, with the goal of identifying actionable customer segments.",
    "Year":2018,
    "Programming Languages":"R",
    "Tools":"Report",
    "Algorithms":"A\/B Testing, Statistical Analysis, Cluster Analysis",
    "Domain":"Retail",
    "Stakeholder":"Esselunga"
  },
  {
    "Name":"Market Basket Analysis",
    "Description":"Performed Market Basket Analysis on Esselunga transactional data to uncover product association rules and frequent itemsets, supporting cross-selling strategies and in-store layout optimization.",
    "Year":2018,
    "Programming Languages":"R, Python",
    "Tools":"Report",
    "Algorithms":"Association Analysis, Market Basket Analysis",
    "Domain":"Retail",
    "Stakeholder":"Esselunga"
  },
  {
    "Name":"Insurance-based Recommender System",
    "Description":"Designed a recommender system to suggest the most suitable insurance policy to clients of a major Italian insurance company, leveraging both historical product ownership and metadata on customer and product features. The evaluation process began with a simple frequency-based baseline, recommending the most common policy across the dataset. From there, increasingly sophisticated techniques were introduced, including content-based filtering based on customer and product attributes, collaborative filtering through user- and item-based k-NN, and matrix factorization approaches like SVD. More advanced models such as gradient boosted decision trees (e.g., XGBoost) and neural collaborative filtering were also explored to capture complex interactions. The performance of each model was evaluated using standard recommendation metrics such as Precision@k, Recall@k, and MAP.",
    "Year":2018,
    "Programming Languages":"Python",
    "Tools":"Kubernetes, Databricks",
    "Algorithms":"Recommender System",
    "Domain":"Insurance",
    "Stakeholder":"Cattolica Assicurazioni"
  },
  {
    "Name":"NLP end-to-end system on bank's product claims",
    "Description":"Developed an end-to-end NLP system to extract, process, and operationalize information from customer claims related to banking products. The approach leveraged Named Entity Recognition (NER) techniques to identify and classify the underlying root causes of each complaint. On top of the extracted entities, an anomaly detection layer was implemented to proactively identify unusual patterns and potential operational risks. Finally, results were made accessible through an interactive Streamlit dashboard, allowing stakeholders to explore trends, entity distributions, and flagged anomalies in real time.",
    "Year":2019,
    "Programming Languages":"Python",
    "Tools":"Streamlit, Kubernetes",
    "Algorithms":"NLP Stack(Tokenization, Tf-IDF, NER, Embeddings), t-sne, XgBoost classifier",
    "Domain":"Finance",
    "Stakeholder":"Intesa Sanpaolo, BPER"
  },
  {
    "Name":"Customer Knowledge",
    "Description":"Led a team of four data scientists in making sense of over 4.5 billion daily transactional records from banking customers. The objective was to classify users into meaningful behavioral segments based on features such as payment purpose and market type associated with each transaction, enabling targeted marketing strategies. To handle the scale and velocity of the data, the entire pipeline was built using parallelized computing frameworks, leveraging Apache Spark to train and deploy models efficiently on massive datasets.",
    "Year":2020,
    "Programming Languages":"Spark",
    "Tools":"Databricks",
    "Algorithms":"NLP Stack, BERTopic, HDBSCAN",
    "Domain":"Finance",
    "Stakeholder":"Unicredit, Poste Italiane"
  },
  {
    "Name":"Python & ML Trainer",
    "Description":"Delivered corporate training courses covering Python programming (from fundamentals to advanced applications) and Machine Learning (from theoretical foundations to practical implementation in Python). Led classes of up to 20 participants with diverse backgrounds and seniority levels, guiding them through hands-on exercises and real-world examples. Emphasis was placed on active coding sessions and practical understanding, enabling participants to progress from first steps in Python to applied ML workflows on their own laptops.",
    "Year":2021,
    "Programming Languages":"Python",
    "Tools":"Pandas, Numpy, PyTorch, Keras",
    "Algorithms":"\/",
    "Domain":"Education",
    "Stakeholder":"Prometeia, Unicredit DE, Audi IT"
  },
  {
    "Name":"Marketing Mix Modelling",
    "Description":"Conducted a Marketing Mix Modeling (MMM) study to quantify the impact of different marketing levers on Ferrero’s product sales. Using time-series regression techniques, I decomposed sales variations across channels, isolating the contribution of marketing campaigns (TV, digital, in-store promotions) while controlling for seasonality, trends, and external factors. The model enabled the estimation of ROI for each marketing channel and provided actionable insights to optimize future media allocation strategies.",
    "Year":2022,
    "Programming Languages":"Python",
    "Tools":"Databricks, Custom Front-end",
    "Algorithms":"Hierarchical Bayesian Regression",
    "Domain":"Retail",
    "Stakeholder":"Ferrero"
  },
  {
    "Name":"Correlation Analysis",
    "Description":"Developed a custom correlation analysis pipeline to assess the price elasticity of Ferrero’s products. The objective was to estimate the strength and direction of the relationship between product prices and sales volumes, accounting for potential confounding variables such as seasonality and promotional effects. This analysis supported data-driven pricing strategy decisions and informed elasticity assumptions in broader econometric models.",
    "Year":2022,
    "Programming Languages":"Python",
    "Tools":"Databricks",
    "Algorithms":"Custom Algorithm",
    "Domain":"Retail",
    "Stakeholder":"Ferrero"
  },
  {
    "Name":"ML Ops structure",
    "Description":"Designed and implemented the MLOps infrastructure for Ferrero’s AI team, enabling scalable, reliable deployment and monitoring of machine learning models across projects. The architecture included version-controlled pipelines, automated model training and evaluation workflows, and CI\/CD integration for seamless production deployment.",
    "Year":2023,
    "Programming Languages":"Git",
    "Tools":"Github",
    "Algorithms":"\/",
    "Domain":"Retail",
    "Stakeholder":"Ferrero"
  },
  {
    "Name":"Revisight",
    "Description":"Built an end-to-end NLP system—Revisight—designed to process, translate, and classify customer reviews of Ferrero products across eCommerce platforms in near real-time. The pipeline handled multilingual input, applied machine translation where needed, and performed sentiment analysis and topic classification to extract actionable insights. The system was optimized for low-latency processing and deployed with real-time monitoring to support marketing and product teams.",
    "Year":2023,
    "Programming Languages":"Python",
    "Tools":"Hugging Face, MISTRAL, Databricks, Streamlit",
    "Algorithms":"NLP Stack, BERTopic, Top2Vec",
    "Domain":"eCommerce",
    "Stakeholder":"Ferrero"
  },
  {
    "Name":"Operative Rolling Forecast",
    "Description":"Developed a forecasting framework to predict Ferrero’s product sales in terms of volumes and values over a 3-year horizon. Starting from historical P&L data, the model integrated macroeconomic indicators, seasonality patterns, and external factors to generate dynamic, scenario-based projections. The system supported continuous updates with new data, enabling rolling forecasts and providing strategic input for planning and investment decisions.",
    "Year":2024,
    "Programming Languages":"Python, Pytorch",
    "Tools":"Databricks",
    "Algorithms":"SARIMAX, Prophet",
    "Domain":"Retail",
    "Stakeholder":"Ferrero"
  }
]